Catalogs/Renault_ПравилаУчастияВПрограммеЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПравилаУчастияВПрограммеЛояльности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоРаботОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоРаботДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоЗапчастейОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоЗапчастейДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоЗаказНарядОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоЗаказНарядДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПроверкиРабот</Name>
					<Comment>В днях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПроверкиЗапчастей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПроверкиСуммыДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДляОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИключаемыеВидыРемонта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ПравилаУчастияВПрограммеЛояльности/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Проверка на доступ к работе с АРМ
	Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоИзменятьПравилаУчастияВПрограммеЛояльности(ПараметрыСеанса.Пользователь) Тогда
		Предупреждение("У вас нет прав на изменение правил участия.");
		Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОтборДЦ = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
	
	Отказать = ЛОЖЬ;
	
	Выборка = Справочники.Renault_ПравилаУчастияВПрограммеЛояльности.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = ТекущийОбъект.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		
		Если (ТекущийОбъект.СуммаВсегоЗаказНарядОт <= Выборка.СуммаВсегоЗаказНарядОт И ТекущийОбъект.СуммаВсегоЗаказНарядДо >= Выборка.СуммаВсегоЗаказНарядДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗаказНарядОт >= Выборка.СуммаВсегоЗаказНарядОт И ТекущийОбъект.СуммаВсегоЗаказНарядДо <= Выборка.СуммаВсегоЗаказНарядДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗаказНарядОт <= Выборка.СуммаВсегоЗаказНарядОт И ТекущийОбъект.СуммаВсегоЗаказНарядДо >= Выборка.СуммаВсегоЗаказНарядОт)
			Тогда
			
			
			Если ТекущийОбъект.СуммаВсегоЗаказНарядОт > 0 ИЛИ ТекущийОбъект.СуммаВсегоЗаказНарядДо > 0 Тогда
				
				Сообщить("Есть свопадения по сумме заказ-наряда.");
				
				Отказать = Истина;
				
			КонецЕсли;
			
			
		ИначеЕсли (ТекущийОбъект.СуммаВсегоРаботОт <= Выборка.СуммаВсегоРаботОт И ТекущийОбъект.СуммаВсегоРаботДо >= Выборка.СуммаВсегоРаботДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоРаботОт >= Выборка.СуммаВсегоРаботОт И ТекущийОбъект.СуммаВсегоРаботДо <= Выборка.СуммаВсегоРаботДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоРаботОт <= Выборка.СуммаВсегоРаботОт И ТекущийОбъект.СуммаВсегоРаботДо >= Выборка.СуммаВсегоРаботОт)
			Тогда 
			
			Если ТекущийОбъект.СуммаВсегоРаботОт > 0 ИЛИ ТекущийОбъект.СуммаВсегоРаботДо > 0 Тогда
				
				Сообщить("Есть свопадения по сумме работ.");
				
				Отказать = Истина; 
				
			КонецЕсли;
			
			
		ИначеЕсли (ТекущийОбъект.СуммаВсегоЗапчастейОт <= Выборка.СуммаВсегоЗапчастейОт И ТекущийОбъект.СуммаВсегоЗапчастейДо >= Выборка.СуммаВсегоЗапчастейДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗапчастейОт >= Выборка.СуммаВсегоЗапчастейОт И ТекущийОбъект.СуммаВсегоЗапчастейДо <= Выборка.СуммаВсегоЗапчастейДо)
			ИЛИ (ТекущийОбъект.СуммаВсегоЗапчастейОт <= Выборка.СуммаВсегоЗапчастейОт И ТекущийОбъект.СуммаВсегоЗапчастейДо >= Выборка.СуммаВсегоЗапчастейОт)
			Тогда 
			
			Если ТекущийОбъект.СуммаВсегоЗапчастейОт > 0 ИЛИ ТекущийОбъект.СуммаВсегоЗапчастейДо > 0 Тогда
				
				Сообщить("Есть свопадения по сумме запчастей.");
				
				Отказать = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если Отказать = Истина Тогда
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры
